#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```hcl
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra/terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/cloudops-practice/cloudops-practice/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/cloudops-practice/cloudops-practice

To view this run in a browser, visit:
https://app.terraform.io/app/andrewdq/cloudops-practice/runs/run-FiNgTfwvFciBdzbX

Waiting for the plan to start...

Terraform v1.12.2
on linux_amd64
Initializing plugins and modules...
random_password.postgresql_admin_password: Refreshing state... [id=none]
data.azurerm_client_config.current: Reading...
module.resource_groups["eastasia"].azurerm_resource_group.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg]
module.resource_groups["southeastasia"].azurerm_resource_group.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0xMjIwMzZjMi02YTQ4LTQxODAtYWUyZC1jZmEwZjIzZTBkZjA7b2JqZWN0SWQ9MWRlYmU3NTItZDJhZS00ZTI1LTljMjUtNzc4ZTkzM2U1ZmMwO3N1YnNjcmlwdGlvbklkPTY5NDIxYTAzLWY4ZTYtNGExZS04MWIzLTA3N2FhZWVhNWNlNzt0ZW5hbnRJZD0xNGJhMzgwYi1iOTNhLTRmYzEtYjRlZi04MDM5Y2NhNjFkNzU=]
data.azuread_service_principal.current: Reading...
data.azuread_service_principal.current: Read complete after 3s [id=/servicePrincipals/1debe752-d2ae-4e25-9c25-778e933e5fc0]
module.primary_network.azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet]
module.primary_network.azurerm_network_security_group.aks_nsg[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-primary-vnet-aks-nsg]
module.primary_network.azurerm_subnet.subnets["app"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/app]
module.primary_network.azurerm_subnet.subnets["aks"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/aks]
module.primary_network.azurerm_subnet_network_security_group_association.aks_nsg_association[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/aks]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # azurerm_postgresql_flexible_server.primary will be created
  + resource "azurerm_postgresql_flexible_server" "primary" {
      + administrator_login           = (known after apply)
      + auto_grow_enabled             = false
      + backup_retention_days         = 7
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = true
      + id                            = (known after apply)
      + location                      = "southeastasia"
      + name                          = "roadmap-maker-southeastasia-psql"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "roadmap-maker-southeastasia-rg"
      + sku_name                      = "B_Standard_B1ms"
      + storage_mb                    = 32768
      + storage_tier                  = (known after apply)
      + tags                          = {
          + "application" = "roadmap-maker"
          + "environment" = "prod"
          + "managed-by"  = "terraform"
          + "project"     = "cloudops-practice"
        }
      + version                       = "15"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = false
          + tenant_id                     = "14ba380b-b93a-4fc1-b4ef-8039cca61d75"
        }
    }

  # azurerm_postgresql_flexible_server_active_directory_administrator.primary will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "primary" {
      + id                  = (known after apply)
      + object_id           = "1debe752-d2ae-4e25-9c25-778e933e5fc0"
      + principal_name      = "HCP Backend"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "roadmap-maker-southeastasia-rg"
      + server_name         = "roadmap-maker-southeastasia-psql"
      + tenant_id           = "14ba380b-b93a-4fc1-b4ef-8039cca61d75"
    }

  # azurerm_postgresql_flexible_server_database.primary will be created
  + resource "azurerm_postgresql_flexible_server_database" "primary" {
      + charset   = "utf8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "roadmap_maker"
      + server_id = (known after apply)
    }

  # azurerm_postgresql_flexible_server_firewall_rule.aks_subnet will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "aks_subnet" {
      + end_ip_address   = "10.1.1.255"
      + id               = (known after apply)
      + name             = "AllowAKSSubnet"
      + server_id        = (known after apply)
      + start_ip_address = "10.1.1.0"
    }

  # azurerm_postgresql_flexible_server_firewall_rule.azure_services will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "azure_services" {
      + end_ip_address   = "0.0.0.0"
      + id               = (known after apply)
      + name             = "AllowAzureServices"
      + server_id        = (known after apply)
      + start_ip_address = "0.0.0.0"
    }

  # random_password.postgresql_admin_password will be destroyed
  # (because random_password.postgresql_admin_password is not in configuration)
  - resource "random_password" "postgresql_admin_password" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = true -> null
      - upper       = true -> null
    }

  # module.primary_aks.azurerm_kubernetes_cluster.default will be created
  + resource "azurerm_kubernetes_cluster" "default" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + azure_policy_enabled                = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "roadmap-maker-primary"
      + fqdn                                = (known after apply)
      + http_application_routing_enabled    = false
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.32.5"
      + location                            = "southeastasia"
      + name                                = "roadmap-maker-primary-aks"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "roadmap-maker-southeastasia-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "application"  = "roadmap-maker"
          + "cluster-type" = "primary"
          + "environment"  = "prod"
          + "managed-by"   = "terraform"
          + "project"      = "cloudops-practice"
          + "region"       = "primary"
        }
      + workload_identity_enabled           = false

      + api_server_access_profile (known after apply)

      + auto_scaler_profile (known after apply)

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = 50
          + name                 = "default"
          + node_count           = 2
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = 32
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + tags                 = {
              + "application"  = "roadmap-maker"
              + "cluster-type" = "primary"
              + "environment"  = "prod"
              + "managed-by"   = "terraform"
              + "project"      = "cloudops-practice"
              + "region"       = "primary"
            }
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_B2s"
          + vnet_subnet_id       = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/aks"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity (known after apply)

      + network_profile {
          + dns_service_ip          = (known after apply)
          + docker_bridge_cidr      = (known after apply)
          + ebpf_data_plane         = (known after apply)
          + ip_versions             = (known after apply)
          + load_balancer_sku       = "standard"
          + network_data_plane      = (known after apply)
          + network_mode            = (known after apply)
          + network_plugin          = "azure"
          + network_policy          = "azure"
          + outbound_ip_address_ids = (known after apply)
          + outbound_ip_prefix_ids  = (known after apply)
          + outbound_type           = "loadBalancer"
          + pod_cidr                = (known after apply)
          + pod_cidrs               = (known after apply)
          + service_cidr            = (known after apply)
          + service_cidrs           = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + windows_profile (known after apply)
    }

  # module.primary_network.azurerm_subnet.subnets["aks"] will be updated in-place
  ~ resource "azurerm_subnet" "subnets" {
      ~ address_prefixes                               = [
          ~ "10.0.1.0/24" -> "10.1.1.0/24",
        ]
        id                                             = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/aks"
        name                                           = "aks"
        # (10 unchanged attributes hidden)
    }

  # module.primary_network.azurerm_subnet.subnets["app"] will be updated in-place
  ~ resource "azurerm_subnet" "subnets" {
      ~ address_prefixes                               = [
          ~ "10.0.2.0/24" -> "10.1.2.0/24",
        ]
        id                                             = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/app"
        name                                           = "app"
        # (10 unchanged attributes hidden)
    }

  # module.primary_network.azurerm_virtual_network.this will be updated in-place
  ~ resource "azurerm_virtual_network" "this" {
      ~ address_space           = [
          ~ "10.0.0.0/16" -> "10.1.0.0/16",
        ]
        id                      = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet"
        name                    = "roadmap-maker-primary-vnet"
        tags                    = {
            "application" = "roadmap-maker"
            "environment" = "prod"
            "managed-by"  = "terraform"
            "project"     = "cloudops-practice"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 6 to add, 3 to change, 1 to destroy.


```

</details>

*Pushed by: @AndrewDoan01, Action: `pull_request`*